#include "cSessionManager.h"
cSessionManager::cSessionManager() : mSessionCount(0)
{

}
cSessionManager::~cSessionManager()
{

}


//--------------------------------------------------------------------------------------------------------------------------------------
//목  적 : session 풀링
//작성자 : 이원배
//일  시 : 2021. 04. 05
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::MakeSessionPool(int _make_count)
{
	for (int key = 0;key < _make_count; key++)
	{
		cUser* newsession = new cUser;
		if (newsession != NULL)
		{
  
			mSessionMap.insert(make_pair(key, newsession));
			newsession->SetSessionNum(key);
		}
		else
		{
			printf("make session error\n");
		}
	}

	printf("make session clear\n");
}
//--------------------------------------------------------------------------------------------------------------------------------------
//목  적 : session 접속
//작성자 : 이원배
//일  시 : 2021. 04. 05
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::InputSession()
{
	cSynchronization sync(mCS_SessionManager);
	mSessionCount++;
	printf("현재 Session Count == [ %d ]\n", mSessionCount);
}
//--------------------------------------------------------------------------------------------------------------------------------------
//목  적 : session 종료
//작성자 : 이원배
//일  시 : 2021. 04. 05
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::OutputSession()
{
	cSynchronization sync(mCS_SessionManager);
	mSessionCount--;
	printf("현재 Session Count == [ %d ]\n", mSessionCount);
}